<template>
    <section class="instructions">
        <section class="admin-instruction-block">
            <h3>Як Редагувати та Публікувати</h3> 
            <ol>
                <li>Оберіть вкладку "Редагувати та Публікувати"</li>
                <li>Введіть всю інформації про вакансію</li>
                <li>Натисніть на кнопку "Опублікувати"</li>
            </ol>
            <p>Вся інформація про вакансію буде збережена в базі даних, і після опублікації вона буде активованою</p>
        </section>
        <section class="admin-instruction-block">
            <h3>Про вкладку з усіма вакансіями</h3>
            <p>У вкладці "Вакансії" ви побачите усі вакансії зі статусами "активна" та "неактивна"</p>
            <p>Ви можете легко змінити статус вакансії, натиснувши кнопку "Активувати/Деактивувати" у нижній частині вакансії</p>
            <p>Також ви можете видалити вакансію, натиснувши кнопку "Видалити"</p>
            <p>Ви можете фільтрувати вакансії, натиснувши кнопку у верхній частині та шукати вакансії за їх назвами</p>
        </section>
        <section class="admin-instruction-block">
            <h3>Надіслані вакансії</h3>
            <p>У вкладці "Надіслані вакансії" ви побачите усі вакансії, які користувачі надсилають вам, вони мають статус "надіслана" і не будуть показані у вкладці "Вакансії" та на сторінці роботошукача</p>
            <p>Натиснувши кнопку "Перемістити до вакансій", ви зміните статус цієї вакансії на "неактивна" і зможете редагувати та опублікувати її</p>
            <p>Ви можете видалити цю вакансію, натиснувши кнопку "Видалити"</p>
        </section>
        </section>
</template>

<style scoped>
    .instructions {
        display: flex;
        flex-direction: column;
    }
    .admin-instruction-block {
        border-bottom: 1px solid #fff;
        margin-bottom: 20px;

        h3 {
            font-size: 26px;
            margin-top: 0;
        }
    }
</style>